In [12]:
import pandas as pd
import numpy as np

Return month sales of 5 most expensive products in each product_category

In [13]:
chain_a = pd.read_csv("csv/chain_a.csv")
chain_b = pd.read_csv("csv/chain_b.csv")
chain_c = pd.read_csv("csv/chain_c.csv")
m_product = pd.read_csv("csv/m.product.csv")

In [14]:
chain_geral = pd.concat([chain_a, chain_b, chain_c], axis=0)
chain_geral.head()

       Date  store_id  product_id  volume
0  01-01-19         3         104     228
1  02-01-19         1         114     345
2  03-01-19         1         110     116
3  04-01-19         2         103     152
4  05-01-19         2         111     293

In [15]:
geral_name = pd.merge(chain_geral, m_product, how="left", on="product_id")
geral_name.head()

,Date,store_id,product_id,volume,price,product_category,product_name
0,01-01-19,3,104,228,400,Sandwich,Teriyaki Special
1,02-01-19,1,114,345,180,Chocolte,Blueberry Mix
2,03-01-19,1,110,116,460,Sandwich,Strawberry Fruit
3,04-01-19,2,103,152,150,Fruit,Apple
4,05-01-19,2,111,293,320,Ice Cream,Fruit Mix

In [16]:
geral_name['Date'] = geral_name['Date'].astype('datetime64')

In [17]:
geral_name.dtypes

Date                datetime64[ns]
store_id                     int64
product_id                   int64
volume                       int64
price                        int64
product_category            object
product_name                object
dtype: object

In [18]:
geral_name['month'] = geral_name['Date'].dt.month

In [19]:
geral_name.head()

,Date,store_id,product_id,volume,price,product_category,product_name,month
0,2019-01-01,3,104,228,400,Sandwich,Teriyaki Special,1
1,2019-02-01,1,114,345,180,Chocolte,Blueberry Mix,2
2,2019-03-01,1,110,116,460,Sandwich,Strawberry Fruit,3
3,2019-04-01,2,103,152,150,Fruit,Apple,4
4,2019-05-01,2,111,293,320,Ice Cream,Fruit Mix,5

In [24]:
end2 = geral_name.pivot_table(
    values="volume", index=["product_category"], columns="month", aggfunc="sum", margins=True
)

In [25]:
end2.head()

month,1,2,3,4,5,6,7,8,9,10,11,12,All
product_category,,,,,,,,,,,,,
Chocolate,7004,5857,6720,4295,7090,6852,7093,7301,8753,7327,7464,6568,82324
Chocolte,4762,2262,1099,2641,2283,3028,3086,3522,3672,3880,2965,5159,38359
Cookie,9129,9947,10362,8367,9528,9373,9474,11161,9782,9733,10666,8522,116044
Fruit,21532,19476,19323,20953,19956,15939,19426,20156,20320,19429,21246,21024,238780
Ice Cream,5956,6345,6885,5734,7378,7978,9617,4585,5471,6093,5657,6112,77811